veskotr/furnace-firmware/sdkconfig.defaults
#
# SPI Flash behavior when brownout
#
CONFIG_SPI_FLASH_BROWNOUT_RESET_XMC=y
CONFIG_SPI_FLASH_BROWNOUT_RESET=y
# end of SPI Flash behavior when brownout

#
# Optional and Experimental Features (READ DOCS FIRST)
#

#
# Features here require specific hardware (READ DOCS FIRST!)
#
CONFIG_SPI_FLASH_SUSPEND_TSUS_VAL_US=50
# CONFIG_SPI_FLASH_FORCE_ENABLE_XMC_C_SUSPEND is not set
# CONFIG_SPI_FLASH_FORCE_ENABLE_C6_H2_SUSPEND is not set
CONFIG_SPI_FLASH_PLACE_FUNCTIONS_IN_IRAM=y
# end of Optional and Experimental Features (READ DOCS FIRST)
# end of Main Flash configuration

#
# SPI Flash driver
#
# CONFIG_SPI_FLASH_VERIFY_WRITE is not set
# CONFIG_SPI_FLASH_ENABLE_COUNTERS is not set
CONFIG_SPI_FLASH_ROM_DRIVER_PATCH=y
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ABORTS=y
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_FAILS is not set
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED is not set
# CONFIG_SPI_FLASH_SHARE_SPI1_BUS is not set
# CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE is not set
CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
CONFIG_SPI_FLASH_ERASE_YIELD_DURATION_MS=20
CONFIG_SPI_FLASH_ERASE_YIELD_TICKS=1
CONFIG_SPI_FLASH_WRITE_CHUNK_SIZE=8192
# CONFIG_SPI_FLASH_SIZE_OVERRIDE is not set
# CONFIG_SPI_FLASH_CHECK_ERASE_TIMEOUT_DISABLED is not set
# CONFIG_SPI_FLASH_OVERRIDE_CHIP_DRIVER_LIST is not set

#
# Auto-detect flash chips
#
CONFIG_SPI_FLASH_VENDOR_XMC_SUPPORT_ENABLED=y
CONFIG_SPI_FLASH_VENDOR_GD_SUPPORT_ENABLED=y
CONFIG_SPI_FLASH_VENDOR_ISSI_SUPPORT_ENABLED=y
CONFIG_SPI_FLASH_VENDOR_MXIC_SUPPORT_ENABLED=y
CONFIG_SPI_FLASH_VENDOR_WINBOND_SUPPORT_ENABLED=y
CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP=y
# CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP is not set
# CONFIG_SPI_FLASH_SUPPORT_TH_CHIP is not set
# end of Auto-detect flash chips

CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE=y
# end of SPI Flash driver

#
# SPIFFS Configuration
#
CONFIG_SPIFFS_MAX_PARTITIONS=3

#
# SPIFFS Cache Configuration
#
CONFIG_SPIFFS_CACHE=y
CONFIG_SPIFFS_CACHE_WR=y
# CONFIG_SPIFFS_CACHE_STATS is not set
# end of SPIFFS Cache Configuration

CONFIG_SPIFFS_PAGE_CHECK=y
CONFIG_SPIFFS_GC_MAX_RUNS=10
# CONFIG_SPIFFS_GC_STATS is not set
CONFIG_SPIFFS_PAGE_SIZE=256
CONFIG_SPIFFS_OBJ_NAME_LEN=32
# CONFIG_SPIFFS_FOLLOW_SYMLINKS is not set
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
CONFIG_SPIFFS_META_LENGTH=4
CONFIG_SPIFFS_USE_MTIME=y

#
# Debug Configuration
#
# CONFIG_SPIFFS_DBG is not set
# CONFIG_SPIFFS_API_DBG is not set
# CONFIG_SPIFFS_GC_DBG is not set
# CONFIG_SPIFFS_CACHE_DBG is not set
# CONFIG_SPIFFS_CHECK_DBG is not set
# CONFIG_SPIFFS_TEST_VISUALISATION is not set
# end of Debug Configuration
# end of SPIFFS Configuration

#
# TCP Transport
#

#
# Websocket
#
CONFIG_WS_TRANSPORT=y
CONFIG_WS_BUFFER_SIZE=1024
# CONFIG_WS_DYNAMIC_BUFFER is not set
# end of Websocket
# end of TCP Transport

#
# Ultra Low Power (ULP) Co-processor
#
# CONFIG_ULP_COPROC_ENABLED is not set

#
# ULP Debugging Options
#
# end of ULP Debugging Options
# end of Ultra Low Power (ULP) Co-processor

#
# Unity unit testing library
#
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y
# CONFIG_UNITY_ENABLE_64BIT is not set
# CONFIG_UNITY_ENABLE_COLOR is not set
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
# CONFIG_UNITY_ENABLE_FIXTURE is not set
# CONFIG_UNITY_ENABLE_BACKTRACE_ON_FAIL is not set
# CONFIG_UNITY_TEST_ORDER_BY_FILE_PATH_AND_LINE is not set
# end of Unity unit testing library

#
# Virtual file system
#
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_DIR=y
CONFIG_VFS_SUPPORT_SELECT=y
CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
# CONFIG_VFS_SELECT_IN_RAM is not set
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_VFS_MAX_COUNT=8

#
# Host File System I/O (Semihosting)
#
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
# end of Host File System I/O (Semihosting)

CONFIG_VFS_INITIALIZE_DEV_NULL=y
# end of Virtual file system

#
# Wear Levelling
#
# CONFIG_WL_SECTOR_SIZE_512 is not set
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# Wi-Fi Provisioning Manager
#
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
CONFIG_WIFI_PROV_STA_ALL_CHANNEL_SCAN=y
# CONFIG_WIFI_PROV_STA_FAST_SCAN is not set
# end of Wi-Fi Provisioning Manager

#
# Commands Dispatcher
#
CONFIG_COMMANDS_DISPATCHER_QUEUE_SIZE=10
CONFIG_COMMANDS_DISPATCHER_TASK_STACK_SIZE=4096
CONFIG_COMMANDS_DISPATCHER_TASK_PRIORITY=5
CONFIG_COMMANDS_DISPATCHER_TASK_NAME="COMMANDS_DISPATCHER_NAME"
CONFIG_COMMANDS_DISPATCHER_MAX_HANDLERS=5
CONFIG_COMMANDS_DISPATCHER_COMPONENT_ID=7
CONFIG_COMMANDS_DISPATCHER_HEARTBEAT_TIMEOUT_MS=10000
# end of Commands Dispatcher

#
# Coordinator
#
CONFIG_COORDINATOR_TASK_STACK_SIZE=4096
CONFIG_COORDINATOR_TASK_PRIORITY=5
CONFIG_COORDINATOR_TASK_NAME="COORDINATOR_TASK"
CONFIG_COORDINATOR_MAX_HEATING_PROFILE_STEPS=20
CONFIG_COORDINATOR_MAX_PROFILES_STORED=5
CONFIG_COORDINATOR_PID_TICK_INTERVAL_MS=1000
CONFIG_COORDINATOR_SENSOR_AGGREGATE_STALE_TIMEOUT_MS=5000
CONFIG_COORDINATOR_SENSOR_RECOVERY_VALID_AGGREGATES=3
CONFIG_COORDINATOR_SENSOR_AUTO_RECOVERY=y
CONFIG_COORDINATOR_PROFILE_COMPLETE_TEMP_C=40
CONFIG_COORDINATOR_OVERSHOOT_THRESHOLD_C=30
CONFIG_COORDINATOR_RAMP_EASE_BAND_C=6
CONFIG_COORDINATOR_HANDOVER_TOLERANCE_X10=5
CONFIG_COORDINATOR_STALL_CHECK_MS=180000
CONFIG_COORDINATOR_STALL_MIN_LAG_C=5
CONFIG_COORDINATOR_STALL_RATE_FRACTION_PCT=50
CONFIG_COORDINATOR_HOLD_BAND_C=4
CONFIG_COORDINATOR_HOLD_VIOLATION_MS=300000
CONFIG_COORDINATOR_COMPONENT_ID=4
CONFIG_COORDINATOR_HEARTBEAT_TIMEOUT_MS=5000
# end of Coordinator

#
# Debug Console Configuration
#
CONFIG_DEBUG_CONSOLE_TASK_STACK_SIZE=4096
CONFIG_DEBUG_CONSOLE_TASK_PRIORITY=2
CONFIG_DEBUG_CONSOLE_TASK_NAME="debug_console_task"
CONFIG_DEBUG_CONSOLE_MAX_COMMAND_LENGTH=256
CONFIG_DEBUG_CONSOLE_MAX_ARGUMENTS=8
CONFIG_DEBUG_CONSOLE_MAX_REGISTERED_COMMANDS=20
# end of Debug Console Configuration

#
# Device Manager Configuration
#
CONFIG_DEVICE_MANAGER_COMPONENT_ID=1
CONFIG_DEVICE_MANAGER_HEARTBEAT_TIMEOUT_MS=5000
CONFIG_DEVICE_MANAGER_MODBUS_UART_NUMBER=2
CONFIG_DEVICE_MANAGER_MAX_DEVICES=32
CONFIG_DEVICE_MANAGER_MODBUS_TX_PIN=27
CONFIG_DEVICE_MANAGER_MODBUS_RX_PIN=26
CONFIG_DEVICE_MANAGER_DE_PIN=25
CONFIG_DEVICE_MANAGER_MODBUS_BAUD_RATE=9600
CONFIG_DEVICE_MANAGER_TASK_STACK_SIZE=4096
CONFIG_DEVICE_MANAGER_TASK_PRIORITY=5
CONFIG_DEVICE_MANAGER_TASK_NAME="device_manager_task"
CONFIG_DEVICE_MANAGER_UPDATE_INTERVAL_MS=1000
# end of Device Manager Configuration

#
# Error Manager
#
CONFIG_ERROR_MANGER_MAX_MODULES=10
# end of Error Manager

#
# Event Manager
#
CONFIG_EVENT_MANAGER_QUEUE_SIZE=32
CONFIG_EVENT_MANAGER_TASK_STACK_SIZE=4096
CONFIG_EVENT_MANAGER_TASK_PRIORITY=5
CONFIG_EVENT_MANAGER_TASK_NAME="event_manager_task"
# end of Event Manager

#
# Fan Controller
#
CONFIG_FAN_CONTROLLER_GPIO_PIN=19
CONFIG_FAN_CONTROLLER_AUTO_ON_C=35
CONFIG_FAN_CONTROLLER_AUTO_OFF_C=32
# end of Fan Controller

#
# Health Monitor Config
#
CONFIG_HEARTH_BEAT_COUNT=8
CONFIG_HEALTH_MONITOR_TASK_STACK_SIZE=4096
CONFIG_HEALTH_MONITOR_TASK_PRIORITY=6
CONFIG_HEALTH_MONITOR_TASK_NAME="health_monitor_task"
CONFIG_HEALTH_MONITOR_CHECK_INTERVAL_MS=2000
CONFIG_HEALTH_MONITOR_TEMP_MONITOR_MAX_MISSES=2
CONFIG_HEALTH_MONITOR_TEMP_MONITOR_MAX_SILENCE_MS=2000
CONFIG_HEALTH_MONITOR_TEMP_PROCESSOR_MAX_MISSES=2
CONFIG_HEALTH_MONITOR_TEMP_PROCESSOR_MAX_SILENCE_MS=2000
CONFIG_HEALTH_MONITOR_HEATER_CONTROLLER_MAX_MISSES=2
CONFIG_HEALTH_MONITOR_HEATER_CONTROLLER_MAX_SILENCE_MS=2000
CONFIG_HEALTH_MONITOR_COORDINATOR_MAX_MISSES=2
CONFIG_HEALTH_MONITOR_COORDINATOR_MAX_SILENCE_MS=2000
# end of Health Monitor Config

#
# Heater Controller
#
CONFIG_HEATER_CONTACTOR_GPIO_PIN=22
CONFIG_HEATER_SSR_GPIO_PIN=21
CONFIG_HEATER_WINDOW_SIZE_MS=5000
CONFIG_HEATER_CONTROLLER_TASK_NAME="heater_controller_task"
CONFIG_HEATER_CONTROLLER_TASK_STACK_SIZE=4096
CONFIG_HEATER_CONTROLLER_TASK_PRIORITY=5
CONFIG_HEATER_CONTROLLER_COMPONENT_ID=2
CONFIG_HEATER_CONTROLLER_HEARTBEAT_TIMEOUT_MS=15000
# end of Heater Controller

#
# Logging
#
CONFIG_LOG_TASK_STACK_SIZE=4096
CONFIG_LOG_TASK_PRIORITY=4
CONFIG_LOG_TASK_NAME="LOG_TASK"
CONFIG_LOG_ENABLE=y
CONFIG_LOG_LEVEL=4
CONFIG_LOG_QUEUE_SIZE=64
CONFIG_LOG_MAX_MESSAGE_LENGTH=64
CONFIG_LOG_MAX_RING_BUFFER_SIZE=100
CONFIG_LOG_PANIC_BUFFER_COUNT=20
# end of Logging

#
# Device Manager Configuration
#

#
# Nextion HMI
#
CONFIG_NEXTION_HMI_ENABLED=y

#
# UART Configuration
#
CONFIG_NEXTION_UART_PORT_NUM=1
CONFIG_NEXTION_UART_BAUD_RATE=115200
CONFIG_NEXTION_UART_TX_PIN=32
CONFIG_NEXTION_UART_RX_PIN=33
CONFIG_NEXTION_UART_RX_BUF_SIZE=2048
CONFIG_NEXTION_UART_TX_BUF_SIZE=2048
CONFIG_NEXTION_LINE_BUF_SIZE=256
CONFIG_NEXTION_UART_RESPONSE_TIMEOUT_MS=2000
CONFIG_NEXTION_UART_PACKET_ACK_TIMEOUT_MS=500
# end of UART Configuration

#
# Display Configuration
#
CONFIG_NEXTION_MAIN_GRAPH_WIDTH=764
CONFIG_NEXTION_MAIN_GRAPH_HEIGHT=321
CONFIG_NEXTION_PROGRAMS_GRAPH_WIDTH=1024
CONFIG_NEXTION_PROGRAMS_GRAPH_HEIGHT=449
CONFIG_NEXTION_GRAPH_DISP_ID=6
CONFIG_NEXTION_PROGRAMS_GRAPH_ID=50
CONFIG_NEXTION_PAGE_MAIN="main_page"
CONFIG_NEXTION_PAGE_PROGRAMS="programs_page"
CONFIG_NEXTION_PAGE_SETTINGS="settings_page"
# CONFIG_NEXTION_HAS_WIFI is not set
# CONFIG_NEXTION_HAS_BLUETOOTH is not set
# end of Display Configuration

#
# Program Editor
#
CONFIG_NEXTION_PROGRAMS_PAGE_STAGE_COUNT=5
CONFIG_NEXTION_PROGRAMS_PAGE_COUNT=3
# end of Program Editor

#
# Operational Limits
#
# CONFIG_NEXTION_OP_TIME_OVERRIDE_ENABLE is not set
CONFIG_NEXTION_MAX_OPERATIONAL_TIME_MIN=10080
CONFIG_NEXTION_MIN_OPERATIONAL_TIME_MIN=1
CONFIG_NEXTION_MIN_TEMPERATURE_C=20
CONFIG_NEXTION_MAX_TEMPERATURE_C=170
CONFIG_NEXTION_SENSOR_READ_FREQUENCY_SEC=1
CONFIG_NEXTION_DELTA_T_MAX_PER_MIN_X10=30
CONFIG_NEXTION_DELTA_T_MIN_PER_MIN_X10=-30
CONFIG_NEXTION_T_DELTA_MIN_MIN=1
CONFIG_NEXTION_HEATER_POWER_KW=20
CONFIG_NEXTION_COOLDOWN_RATE_X10=10
# end of Operational Limits

#
# Validation Tolerances
#
CONFIG_NEXTION_TIME_TOLERANCE_SEC=30
CONFIG_NEXTION_TEMP_TOLERANCE_C=2
CONFIG_NEXTION_DELTA_TEMP_TOLERANCE_C_X10=5
# end of Validation Tolerances

#
# Program Storage
#
CONFIG_NEXTION_MAX_PROGRAMS=200
CONFIG_NEXTION_PROGRAM_FILE_SIZE=4096
CONFIG_NEXTION_PROGRAM_FILE_EXTENSION=".prg"
CONFIG_NEXTION_FILE_READ_CHUNK_SIZE=512
CONFIG_NEXTION_FILE_WRITE_CHUNK_SIZE=512
CONFIG_NEXTION_HMI_PROFILE_SLOT_COUNT=1
# end of Program Storage

#
# Event Dispatcher Configuration
#

#
# HMI Coordinator Task
#
CONFIG_NEXTION_COORDINATOR_TASK_STACK_SIZE=8192
CONFIG_NEXTION_COORDINATOR_TASK_PRIORITY=5
CONFIG_NEXTION_COORDINATOR_QUEUE_DEPTH=8
CONFIG_NEXTION_COORDINATOR_COMPONENT_ID=5
CONFIG_NEXTION_COORDINATOR_HEARTBEAT_TIMEOUT_MS=5000
# end of HMI Coordinator Task

#
# Core Task Configuration
#
CONFIG_NEXTION_RX_TASK_STACK_SIZE=4096
CONFIG_NEXTION_RX_TASK_PRIORITY=10
CONFIG_NEXTION_RX_COMPONENT_ID=6
CONFIG_NEXTION_RX_HEARTBEAT_TIMEOUT_MS=5000
# end of Core Task Configuration
# end of Nextion HMI

#
# PID Controller Configuration
#
CONFIG_PID_KP=115
CONFIG_PID_KI=1
CONFIG_PID_KD=0
CONFIG_PID_OUTPUT_MIN=0
CONFIG_PID_OUTPUT_MAX=100
# CONFIG_PID_ADAPTIVE_OUTPUT_LIMIT_ENABLED is not set
# CONFIG_PID_FEEDFORWARD_ENABLED is not set
CONFIG_PID_FF_T_LOW_C=100
CONFIG_PID_FF_PCT_LOW=0
CONFIG_PID_FF_T_HIGH_C=200
CONFIG_PID_FF_PCT_HIGH=0
# end of PID Controller Configuration

#
# Run Indicator
#
# CONFIG_RUN_INDICATOR_ENABLED is not set
# end of Run Indicator

#
# SPI
#

#
# Bus Settings
#
CONFIG_SPI_BUS_MISO=12
CONFIG_SPI_BUS_MOSI=13
CONFIG_SPI_BUS_SCK=14
CONFIG_SPI_BUS_MODE=0
CONFIG_SPI_CLOCK_SPEED_HZ=50000
CONFIG_SPI_TRANSACTION_TIMEOUT_MS=1000
CONFIG_SPI_MAX_NUM_SLAVES=1
CONFIG_SPI_MAX_TRANSFER_SIZE=64
# end of Bus Settings

#
# Slave CS Pins
#
CONFIG_SPI_SLAVE1_CS=15
CONFIG_SPI_SLAVE2_CS=4
CONFIG_SPI_SLAVE3_CS=5
CONFIG_SPI_SLAVE4_CS=16
CONFIG_SPI_SLAVE5_CS=17
CONFIG_SPI_SLAVE6_CS=18
CONFIG_SPI_SLAVE7_CS=19
CONFIG_SPI_SLAVE8_CS=21
CONFIG_SPI_SLAVE9_CS=22
# end of Slave CS Pins
# end of SPI

#
# Temperature Sensor Device Configuration
#
CONFIG_TEMP_SENSOR_DEVICE_MAX_DEVICES=16
CONFIG_TEMP_SENSOR_MODBUS_START_ADDRESS=1
# end of Temperature Sensor Device Configuration

#
# Temperature Processor
#
CONFIG_TEMP_SENSORS_MAX_SENSORS=9
CONFIG_TEMP_DELTA_THRESHOLD=2
CONFIG_TEMP_PROCESSOR_TASK_STACK_SIZE=4096
CONFIG_TEMP_PROCESSOR_TASK_PRIORITY=5
CONFIG_TEMP_PROCESSOR_TASK_NAME="TEMP_PROCESSOR_TASK"
CONFIG_TEMP_PROCESSOR_HEART_BEAT_TIMEOUT_MS=5000
CONFIG_TEMP_PROCESSOR_COMPONENT_ID=3
CONFIG_TEMP_PROCESSOR_TEMPERATURE_BUFFER_SIZE=10
# end of Temperature Processor

#
# Time Component
#
CONFIG_TIME_COMPONENT_TASK_STACK_SIZE=4096
CONFIG_TIME_COMPONENT_TASK_PRIORITY=5
CONFIG_TIME_COMPONENT_TASK_NAME="TIME_TASK"
# end of Time Component

#
# Transmitter Diagnostics
#
CONFIG_TRANSMITTER_DIAGNOSTICS_SCAN_START_ADDR=1
CONFIG_TRANSMITTER_DIAGNOSTICS_SCAN_END_ADDR=16
# end of Transmitter Diagnostics

#
# Modbus configuration
#
CONFIG_FMB_COMM_MODE_TCP_EN=y
CONFIG_FMB_TCP_PORT_DEFAULT=502
CONFIG_FMB_TCP_PORT_MAX_CONN=5
CONFIG_FMB_TCP_CONNECTION_TOUT_SEC=2
CONFIG_FMB_TCP_KEEP_ALIVE_TOUT_SEC=4
# CONFIG_FMB_TCP_UID_ENABLED is not set
CONFIG_FMB_COMM_MODE_RTU_EN=y
CONFIG_FMB_COMM_MODE_ASCII_EN=y
CONFIG_FMB_MASTER_TIMEOUT_MS_RESPOND=10000
CONFIG_FMB_MASTER_DELAY_MS_CONVERT=200
CONFIG_FMB_QUEUE_LENGTH=50
CONFIG_FMB_PORT_TASK_STACK_SIZE=4096
CONFIG_FMB_BUFFER_SIZE=260
CONFIG_FMB_SERIAL_ASCII_BITS_PER_SYMB=8
CONFIG_FMB_SERIAL_ASCII_TIMEOUT_RESPOND_MS=1000
CONFIG_FMB_PORT_TASK_PRIO=10
# CONFIG_FMB_PORT_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_FMB_PORT_TASK_AFFINITY_CPU0=y
# CONFIG_FMB_PORT_TASK_AFFINITY_CPU1 is not set
CONFIG_FMB_PORT_TASK_AFFINITY=0x0
CONFIG_FMB_CONTROLLER_SLAVE_ID_SUPPORT=y
CONFIG_FMB_CONTROLLER_SLAVE_ID=0x00112233
CONFIG_FMB_CONTROLLER_SLAVE_ID_MAX_SIZE=32
CONFIG_FMB_CONTROLLER_NOTIFY_TIMEOUT=20
CONFIG_FMB_CONTROLLER_NOTIFY_QUEUE_SIZE=20
CONFIG_FMB_CONTROLLER_STACK_SIZE=4096
CONFIG_FMB_EVENT_QUEUE_TIMEOUT=20
# CONFIG_FMB_TIMER_USE_ISR_DISPATCH_METHOD is not set
# CONFIG_FMB_EXT_TYPE_SUPPORT is not set
CONFIG_FMB_FUNC_HANDLERS_MAX=16
# CONFIG_FMB_COMPILER_STATIC_ANALYZER_ENABLE is not set
CONFIG_FMB_MDNS_INTEGRATION_ENABLE=y
# end of Modbus configuration

#
# LittleFS
#
# CONFIG_LITTLEFS_SDMMC_SUPPORT is not set
CONFIG_LITTLEFS_MAX_PARTITIONS=3
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_OBJ_NAME_LEN=64
CONFIG_LITTLEFS_READ_SIZE=128
CONFIG_LITTLEFS_WRITE_SIZE=128
CONFIG_LITTLEFS_LOOKAHEAD_SIZE=128
CONFIG_LITTLEFS_CACHE_SIZE=512
CONFIG_LITTLEFS_BLOCK_CYCLES=512
CONFIG_LITTLEFS_USE_MTIME=y
# CONFIG_LITTLEFS_USE_ONLY_HASH is not set
# CONFIG_LITTLEFS_HUMAN_READABLE is not set
CONFIG_LITTLEFS_MTIME_USE_SECONDS=y
# CONFIG_LITTLEFS_MTIME_USE_NONCE is not set
# CONFIG_LITTLEFS_SPIFFS_COMPAT is not set
# CONFIG_LITTLEFS_FLUSH_FILE_EVERY_WRITE is not set
# CONFIG_LITTLEFS_FCNTL_GET_PATH is not set
# CONFIG_LITTLEFS_MULTIVERSION is not set
# CONFIG_LITTLEFS_MALLOC_STRATEGY_DISABLE is not set
CONFIG_LITTLEFS_MALLOC_STRATEGY_DEFAULT=y
# CONFIG_LITTLEFS_MALLOC_STRATEGY_INTERNAL is not set
CONFIG_LITTLEFS_ASSERTS=y
# CONFIG_LITTLEFS_MMAP_PARTITION is not set
# CONFIG_LITTLEFS_WDT_RESET is not set
# end of LittleFS
# end of Component config

# CONFIG_IDF_EXPERIMENTAL_FEATURES is not set

